In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as pld
import seaborn as sns
import sqlite3

# Exercise 1

Using the same Data Base as in lecture 2, please execute the following:

**1.1** Select unique values in the year column and order them in acsending order. How many unique values are there?

**1.2** Create a column with vehicle age values

**1.3** If a vehicle is older than 45 years, then label it as "45+". Otherwise, label it as "<45". Create a new column that takes these two values

**1.4** How many vehicles are in our dataset that are under 45 and 45 and over?

**1.5** List all unique vehicle name values that have 8 cylinders with horsepower that is greater than 125 but doesn't exceed 200

In [5]:
# 1
import pandas as pd
import sqlite3

conn = sqlite3.connect('../data/mtcars.sqlite')
pd.read_sql_query("SELECT * FROM results", conn)

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name,vehicle_age,age_label
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu,1953,45+
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320,1953,45+
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite,1953,45+
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst,1953,45+
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino,1953,45+
...,...,...,...,...,...,...,...,...,...,...,...
392,27.0,4,140.0,86.0,2790.0,15.6,82,1,ford mustang gl,1941,45+
393,44.0,4,97.0,52.0,2130.0,24.6,82,2,vw pickup,1941,45+
394,32.0,4,135.0,84.0,2295.0,11.6,82,1,dodge rampage,1941,45+
395,28.0,4,120.0,79.0,2625.0,18.6,82,1,ford ranger,1941,45+
396,31.0,4,119.0,82.0,2720.0,19.4,82,1,chevy s-10,1941,45+

In [10]:
#1.1
import sqlite3

conn = sqlite3.connect('../data/mtcars.sqlite')
pd.read_sql_query("SELECT DISTINCT Year FROM results ORDER BY Year ASC", conn)






# Ans: 13 unique values

    year
0     70
1     71
2     72
3     73
4     74
5     75
6     76
7     77
8     78
9     79
10    80
11    81
12    82

In [2]:
#1.2
import sqlite3
import datetime

# Connect to the SQLite database
conn = sqlite3.connect('../data/mtcars.sqlite')
cursor = conn.cursor()

# Add a new column for vehicle age
alter_query = "ALTER TABLE results ADD COLUMN vehicle_age INTEGER"
cursor.execute(alter_query)

# Calculate vehicle age and update the column
current_year = datetime.datetime.now().year
update_query = "UPDATE results SET vehicle_age = ? - CAST(year AS INTEGER)"
cursor.execute(update_query, (current_year,))

# Commit the changes to the database
conn.commit()

# Close the database connection
conn.close()

In [4]:
# 1.3

import sqlite3
import datetime

# Connect to the SQLite database
conn = sqlite3.connect('../data/mtcars.sqlite')
cursor = conn.cursor()

# Add a new column for the age label
alter_query = "ALTER TABLE results ADD COLUMN age_label VARCHAR(10)"
cursor.execute(alter_query)

# Update the age label column based on vehicle age
update_query = "UPDATE results SET age_label = CASE WHEN vehicle_age >= 45 THEN '45+' ELSE '<45' END"
cursor.execute(update_query)

# Commit the changes to the database
conn.commit()

# Close the database connection
conn.close()

In [ ]:
# 1.4

import pandas as pd
import sqlite3


conn = sqlite3.connect('../data/mtcars.sqlite')
cursor = conn.cursor()

query = """SELECT age_label, COUNT(*) as count
           FROM results
           WHERE vehicle_age < 45
           GROUP BY age_label"""
select_query = "SELECT * FROM new_table"
cursor.execute(query)
results = cursor.fetchall()

for row in results:
    print(row)


conn.close()

In [6]:
#1.5

import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('../data/mtcars.sqlite')
cursor = conn.cursor()

# Count the number of vehicles under 45 years
query_under_45 = "SELECT COUNT(*) FROM results WHERE vehicle_age < 45"
cursor.execute(query_under_45)
count_under_45 = cursor.fetchone()[0]

# Count the number of vehicles 45 years and over
query_45_and_over = "SELECT COUNT(*) FROM results WHERE vehicle_age >= 45"
cursor.execute(query_45_and_over)
count_45_and_over = cursor.fetchone()[0]

# Print the results
print("Number of vehicles under 45 years:", count_under_45)
print("Number of vehicles 45 years and over:", count_45_and_over)

# Close the database connection
conn.close()

Number of vehicles under 45 years: 0
Number of vehicles 45 years and over: 397

# Exercise 2 Songs Database

**2.1** Take the songs dataset and turn it into a single `sqlite` database.

In [8]:
# 2.1

import pandas as pd
import sqlite3

# Read the song data into a DataFrame
song_data = pd.read_csv('../data/song_data.csv')

# Create a connection to the SQLite database
conn = sqlite3.connect('song.sqlite')
song_data.to_sql('song_data', conn, if_exists='replace', index=False)

pd.read_sql("SELECT name FROM sqlite_master WHERE type='table'",conn)

        name
0  song_data

In [56]:
pd.read_sql_query("""SELECT * FROM song_data""",conn)

,song_name,song_popularity,song_duration_ms,acousticness,danceability,energy,instrumentalness,key,liveness,loudness,audio_mode,speechiness,tempo,time_signature,audio_valence,duration_minutes_seconds
0,Boulevard of Broken Dreams,73,262333,0.005520,0.496,0.682,0.000029,8,0.0589,-4.095,1,0.0294,167.060,4,0.474,4:22
1,In The End,66,216933,0.010300,0.542,0.853,0.000000,3,0.1080,-6.407,0,0.0498,105.256,4,0.370,3:36
2,Seven Nation Army,76,231733,0.008170,0.737,0.463,0.447000,0,0.2550,-7.828,1,0.0792,123.881,4,0.324,3:51
3,By The Way,74,216933,0.026400,0.451,0.970,0.003550,0,0.1020,-4.938,1,0.1070,122.444,4,0.198,3:36
4,How You Remind Me,56,223826,0.000954,0.447,0.766,0.000000,10,0.1130,-5.065,1,0.0313,172.011,4,0.574,3:43
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18830,Let It Breathe,60,159645,0.893000,0.500,0.151,0.000065,11,0.1110,-16.107,1,0.0348,113.969,4,0.300,2:39
18831,Answers,60,205666,0.765000,0.495,0.161,0.000001,11,0.1050,-14.078,0,0.0301,94.286,4,0.265,3:25
18832,Sudden Love (Acoustic),23,182211,0.847000,0.719,0.325,0.000000,0,0.1250,-12.222,1,0.0355,130.534,4,0.286,3:2
18833,Gentle on My Mind,55,352280,0.945000,0.488,0.326,0.015700,3,0.1190,-12.020,1,0.0328,106.063,4,0.323,5:52
18834,Up to Me,60,193533,0.911000,0.640,0.381,0.000254,4,0.1040,-11.790,1,0.0302,91.490,4,0.581,3:13

# 2.2 Queries

**2.2.1** Use a single query to see if your favorite song is in this dataset

**2.2.2** How many unique popularity scores are there?

**2.2.3** How many song names are in this dataset that contain _'radio edit'_ in their name? Make sure your query is not case sensitive and there is only one single character (space) between _'radio'_ and _'edit'_.

**2.2.4** Write an SQL query to report songs with popularity of 99 and above. How many songs are there?

**2.2.5** Create a new column that contains song duration in the following format m:s. Example, the duration of Boulevard of Broken Dreams is 4:22

**2.2.6** Display the minimum, maximum and average popularity scores. The output of your query should contain only one row with 3 columns.

**2.2.7** Display average popularity scores and count for songs that contain "love" in their name and those that don't. Is there any difference in their popularity? 

**2.2.8** Display top 5 songs with the longest names.

In [25]:
#2.2.1

import sqlite3

import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('song.sqlite')
cursor = conn.cursor()

# Specify your favorite song
favorite_song = "crazy"

# Query to check if the favorite song is in the dataset
query = f"SELECT COUNT(*) FROM song_data WHERE song_name = '{favorite_song}'"

# Execute the query
cursor.execute(query)

# Fetch the result
result = cursor.fetchone()[0]



result

0

In [27]:
#2.2.2

import sqlite3

# Create a connection to the SQLite database
conn = sqlite3.connect('song.sqlite')

pd.read_sql("SELECT DISTINCT(song_popularity) FROM song_data ORDER BY song_popularity",con=conn)


#Ans: 101

     song_popularity
0                  0
1                  1
2                  2
3                  3
4                  4
..               ...
96                96
97                97
98                98
99                99
100              100

[101 rows x 1 columns]

In [63]:
#2.2.3

import sqlite3

# Create a connection to the SQLite database
conn = sqlite3.connect('song.sqlite')

pd.read_sql("SELECT COUNT(*) FROM song_data WHERE LOWER(song_name) LIKE '%radio edit%' AND song_name LIKE '%radio edit%'",con=conn)

   COUNT(*)
0       132

In [62]:
#2.2.4

import sqlite3

# Create a connection to the SQLite database
conn = sqlite3.connect('song.sqlite')

pd.read_sql("SELECT (song_popularity) FROM song_data WHERE  song_popularity >= 99 ",con=conn)

#Ans: 28

    song_popularity
0                99
1                99
2               100
3                99
4               100
5                99
6                99
7               100
8                99
9               100
10               99
11               99
12              100
13              100
14               99
15               99
16              100
17               99
18               99
19               99
20              100
21              100
22               99
23              100
24              100
25               99
26              100
27               99

In [61]:
#2.2.5

import sqlite3

# Create a connection to the SQLite database
conn = sqlite3.connect('song.sqlite')



# Update the values in the new column with the duration in m:s format
cursor.execute("UPDATE song_data SET duration_minutes_seconds = CAST(song_duration_ms / 60000 AS TEXT) || ':' || CAST((song_duration_ms % 60000) / 1000 AS TEXT)")

# Commit the changes to the database
conn.commit()

In [60]:
#2.2.6
import sqlite3

# Create a connection to the SQLite database
conn = sqlite3.connect('song.sqlite')

pd.read_sql("SELECT MIN(song_popularity), MAX(song_popularity), AVG(song_popularity) FROM song_data",con=conn)

   MIN(song_popularity)  MAX(song_popularity)  AVG(song_popularity)
0                     0                   100             52.991877

In [59]:
#2.2.7

import sqlite3
import pandas as pd

# Create a connection to the SQLite database
conn = sqlite3.connect('song.sqlite')

# Construct the SQL query with subqueries
query = """
SELECT 
    (SELECT AVG(song_popularity) FROM song_data WHERE LOWER(song_name) LIKE '%love%') AS avg_popularity_with_love,
    (SELECT AVG(song_popularity) FROM song_data WHERE LOWER(song_name) NOT LIKE '%love%') AS avg_popularity_without_love,
    (SELECT COUNT(*) FROM song_data WHERE LOWER(song_name) NOT LIKE '%love%') AS count_without_love
"""

# Execute the query and read the result into a DataFrame
pd.read_sql(query, con=conn)

   avg_popularity_with_love  avg_popularity_without_love  count_without_love
0                 54.390411                    52.935487               18105

In [58]:
#2.2.8

# Create a connection to the SQLite database
conn = sqlite3.connect('song.sqlite')

pd.read_sql("SELECT song_name FROM song_data ORDER BY LENGTH(song_name) DESC LIMIT 5",con=conn)

                                           song_name
0  Viajo Sin Ver (Remix) [feat. De La Ghetto, Alm...
1  Riff Off: Mickey/Like A Virgin/Hit Me With You...
2  Wu Tang Forever (ft. Ghostface Killah, Raekwon...
3  Bellas Finals: Price Tag/Don’t You (Forget Abo...
4  I Don’t Wanna Live Forever (Fifty Shades Darke...